app/controllers/assignment2s_controller.rb

SELECT * FROM "assignment2s" ORDER BY created_at ASC LIMIT 9 OFFSET 0
SELECT count(*) AS count_all FROM "assignment2s"
---
  def index
    @assignment2s = Assignment2.paginate(:per_page => 25, :page => params[:page])

SELECT * FROM "assignment2s" WHERE ("assignment2s"."id" = 0)
---
  def show
    @assignment2 = Assignment2.find(params[:id])

SELECT * FROM "assignment2s" WHERE ("assignment2s"."id" = 1)
---
  def edit
    @assignment2 = Assignment2.find(params[:id])

INSERT INTO "assignment2s" ("name", "serial", "location", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at", "description") VALUES('lid', 'l1d', 'on ste', '2011-03-02 14:14:44', 5300, '2011-03-02 14:14:44', 'Lid-White.jpg', 'image/jpeg', '2011-03-02 14:14:43', 'lid jacket for stevie')
---
  def create
    @assignment2 = Assignment2.new(params[:assignment2])

    respond_to do |format|
      if @assignment2.save

SELECT * FROM "assignment2s" WHERE ("assignment2s"."id" = 2)
UPDATE "assignment2s" SET "updated_at" = '2011-03-02 16:23:51', "photo_file_name" = 'Dell_20_inch_LCD_webcam_540x512.JPG', "photo_file_size" = 20184, "photo_updated_at" = '2011-03-02 16:23:51', "photo_content_type" = 'image/jpeg' WHERE "id" = 1
---
  def update
    @assignment2 = Assignment2.find(params[:id])

    respond_to do |format|
      if @assignment2.update_attributes(params[:assignment2])

SELECT * FROM "assignment2s" WHERE ("assignment2s"."id" = 2)
DELETE FROM "assignment2s" WHERE "id" = 2
---
  def destroy
    @assignment2 = Assignment2.find(params[:id])
    @assignment2.destroy { redirect_to(@assignment2, :notice => 'Asset was deleted.') }