app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2011-02-23 14:36:18', '2011-02-23 14:36:18', 'hotch', 'c627c10a54a2ba706305a483049b835742ea6fb0', '0df409d6222c5e3dbf37cb65704b5bc58048db15', 'h@fr.com')

  def usernametaken


		 @phrase = params[:user_username]
		 @user = User.find(:all, :conditions => ["username = ?", @phrase])
---
SELECT * FROM "users" WHERE ("users"."id" = '--- :username